'use strict'


// ------------------------------1-------------------------

// let numbers = [5, 25, 89, 120, 36]



// მასივის ბოლოში დაამატეთ ორი ელემენტი(სტრინგი): javascript და python;


// მასივის დასაწყისში კი დაამატეთ ელემენტი(სტრინგი): html და css;


// გამოიტანეთ ეკრანზე, რამდენი ელემენტი გაქვთ მასივში;


// წაშალეთ მასივიდან პირველი და ბოლო ელემენტი;


// დაბეჭდეთ მასივისი ახალი ელემენტები.







// -----------------------------2-------------------------------


// let fruits = ['orange', 'banana', 'pear']



// გამოიტანეთ ინფორმაცია ეკრანზე თუ რამდენი ელემენტი გაქვთ მასივში;


// მასივის ბოლოს დაამატეთ ორი ელემენტი: ვაშლი და ანანასი;


// მასივის დასაწყისში კი დაამატეთ ელემენტი: საზამთრო;


// გამოიტანეთ ეკრანზე, რამდენი ელემენტი გაქვთ მასივში;


// მასივის მე-3 ადგილას დაამატეთ ელემენტი: მანგო;


// წაშალეთ მასივიდან პირველი და ბოლო ელემენტი;


// გამოიტანეთ ეკრანზე, თუ რამდენი ელემენტი დარჩა მასივში;






// ----------------------------------------3----------------------------------


// let array = [12, 25, 3, 6, 8, 14, 7, 23]

// map-ის გამოყენებით შექმენით ახალი მასივი, რომელშიც array მასივიდან თითოეული ელემენტი იქნება 3-ზე გაყოფილი;





// -----------------------------------------4----------------------------------



// let array = ["hello", 125, "javascript", "html", 43, "css", "scss", "bootstrap", 88, 59, "python"]


// filter-ის გამოყენებით გაფილთრეთ და გამოიტანეთ მარტო ციფრები;




// ----------------------------------5------------------------------------------------

// let languages = ['html', 'css', 'javascript', 'python', 'php']


// ფილტრის საშულებით გაფილტრეთ და გამოიტანეთ მარტო ის სიტყვები რომლების სიმბოლოების რაოდენობა იქნება 3-ზე მეტი;






// ---------------------------------6----------------------------------------------


// let array= ['academy', 'of', 'digital', 'industries']

// Reduce-ის საშუალებით მიიღეთ ერთი კომბინირებული სტრინგი(academy of digital industries);









// --------------------------------------7------------------------------------------


// let item = [12, 'google', 32, null, 'yahoo', 25]


// შექმენით ახალი მასივი map ფუნქციის გამოყენებით შემდეგი ლოგიკით: თუ ელემენტი არის რიცხვი ამ მასივში უნდა იყოს ამ რიცხვის კვადრატი. 
// თუ ელემენტი არის ტექსტი, მაშინ ახალ მასივში უნდა იყოს ეს ტექსტი დიდი ასოებით. სხვა შემთხვევაში ელემენტები უნდა დაემატოს უცვლელად;





// -----------------------------------------8--------------------------------------------




let words = ['Madrid', 'Rome', 'Milan', 'Berlin']

// Filter მეთოდის საშუალებით დააბრუნეთ მასივი, რომელიც შედგება ისეთი სიტყვებისგან რომელიც შეიცავს ასო m-ს ან M-ს;





// -------------------------------9----------------------------------------------------


// let arr1 = [1, 2];
// let arr2 = [3, 4];
// let arr3 = [5, 6];



// Concat მეთოდის საშუალებით გაერთიანეთ ეს სამი მასივი ერთ მასივში





// ---------------------------------10---------------------------------------------------



// let arr = [1, 2, 3, 4, 5]

// Foreach საშუალებით გამოთვალეთ რიცხვების ჯამი





// ---------------------------------------11----------------------------------------------


// let numbers = [-2, 5, 10, -5, -1, 1, 3, 4, -15]

// Filter მეთოდის საშუალებით ამოიღეთ მარტო დადებითი რიცხვები




// --------------------------------------------12-------------------------------------------


// შეამოწმეთ მოცელუმ მასივში let arr = [-1, -2, -3, 4]; არის თუ არა ერთი მაინც დადებითი რიცხვი some მეთიდით





// ---------------------------------------13--------------------------------------------


// let arr = [[2, -3, 5, 11], [1, -30, -11, 100], [-1, -3, -4]]


// Reduce da filter მეთოდებით ამოიღეთ დადებითი რიცხვები





// -------------------------------14-----------------------------------------------


// let array =[23,45,32,5,87,7,3,98]


// Sort მეთოდის საშუელებით დაალაგეთ ელემენტები კლებადონის მიხედვით და ამოიღეთ მინიმალური რიცხვი;

